; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=68, out_folder=htg/blocksworld/training, instance_id=48, seed=2072, goal_proportion=0.1

(define (problem blocksworld-48)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 - object)
 (:init 
    (arm-empty)
    (clear b9)
    (on b9 b33)
    (on b33 b18)
    (on b18 b1)
    (on b1 b4)
    (on b4 b6)
    (on-table b6)
    (clear b52)
    (on b52 b12)
    (on b12 b67)
    (on-table b67)
    (clear b36)
    (on b36 b53)
    (on b53 b27)
    (on b27 b49)
    (on-table b49)
    (clear b26)
    (on-table b26)
    (clear b17)
    (on b17 b43)
    (on b43 b39)
    (on b39 b55)
    (on b55 b47)
    (on-table b47)
    (clear b2)
    (on b2 b5)
    (on-table b5)
    (clear b10)
    (on b10 b48)
    (on b48 b66)
    (on b66 b38)
    (on b38 b68)
    (on-table b68)
    (clear b11)
    (on b11 b7)
    (on b7 b19)
    (on b19 b16)
    (on b16 b54)
    (on b54 b8)
    (on b8 b46)
    (on b46 b62)
    (on b62 b40)
    (on b40 b3)
    (on b3 b58)
    (on b58 b64)
    (on b64 b20)
    (on b20 b23)
    (on b23 b15)
    (on b15 b24)
    (on b24 b41)
    (on-table b41)
    (clear b63)
    (on b63 b21)
    (on b21 b61)
    (on b61 b22)
    (on-table b22)
    (clear b14)
    (on b14 b13)
    (on-table b13)
    (clear b32)
    (on b32 b28)
    (on b28 b59)
    (on b59 b30)
    (on-table b30)
    (clear b34)
    (on-table b34)
    (clear b44)
    (on b44 b60)
    (on b60 b51)
    (on b51 b25)
    (on-table b25)
    (clear b42)
    (on b42 b31)
    (on b31 b37)
    (on b37 b65)
    (on b65 b57)
    (on b57 b35)
    (on b35 b56)
    (on b56 b50)
    (on b50 b29)
    (on b29 b45)
    (on-table b45))
 (:goal  (and 
    (clear b5)
    (on-table b5)
    (clear b4)
    (on b4 b2)
    (on b2 b3)
    (on b3 b6)
    (on b6 b1)
    (on-table b1))))

; plan
1. (unstack b9 b33)
   deleted: (on b9 b33) (clear b9) (arm-empty)
   added: (holding b9) (clear b33)
   goals met: 1 of 8
2. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 8
3. (unstack b33 b18)
   deleted: (on b33 b18) (clear b33) (arm-empty)
   added: (holding b33) (clear b18)
   goals met: 1 of 8
4. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 1 of 8
5. (unstack b18 b1)
   deleted: (on b18 b1) (clear b18) (arm-empty)
   added: (holding b18) (clear b1)
   goals met: 1 of 8
6. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 1 of 8
7. (unstack b1 b4)
   deleted: (on b1 b4) (clear b1) (arm-empty)
   added: (holding b1) (clear b4)
   goals met: 2 of 8
8. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 3 of 8
9. (unstack b4 b6)
   deleted: (on b4 b6) (clear b4) (arm-empty)
   added: (holding b4) (clear b6)
   goals met: 2 of 8
10. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 4 of 8
11. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 4 of 8
12. (stack b6 b1)
   deleted: (clear b1) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b1)
   goals met: 5 of 8
13. (unstack b11 b7)
   deleted: (on b11 b7) (clear b11) (arm-empty)
   added: (holding b11) (clear b7)
   goals met: 5 of 8
14. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 5 of 8
15. (unstack b7 b19)
   deleted: (on b7 b19) (clear b7) (arm-empty)
   added: (holding b7) (clear b19)
   goals met: 5 of 8
16. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 5 of 8
17. (unstack b19 b16)
   deleted: (on b19 b16) (clear b19) (arm-empty)
   added: (holding b19) (clear b16)
   goals met: 5 of 8
18. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 5 of 8
19. (unstack b16 b54)
   deleted: (on b16 b54) (clear b16) (arm-empty)
   added: (holding b16) (clear b54)
   goals met: 5 of 8
20. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 5 of 8
21. (unstack b54 b8)
   deleted: (on b54 b8) (clear b54) (arm-empty)
   added: (holding b54) (clear b8)
   goals met: 5 of 8
22. (putdown b54)
   deleted: (holding b54)
   added: (clear b54) (arm-empty) (on-table b54)
   goals met: 5 of 8
23. (unstack b8 b46)
   deleted: (on b8 b46) (clear b8) (arm-empty)
   added: (holding b8) (clear b46)
   goals met: 5 of 8
24. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 5 of 8
25. (unstack b46 b62)
   deleted: (on b46 b62) (clear b46) (arm-empty)
   added: (holding b46) (clear b62)
   goals met: 5 of 8
26. (putdown b46)
   deleted: (holding b46)
   added: (clear b46) (arm-empty) (on-table b46)
   goals met: 5 of 8
27. (unstack b62 b40)
   deleted: (on b62 b40) (clear b62) (arm-empty)
   added: (holding b62) (clear b40)
   goals met: 5 of 8
28. (putdown b62)
   deleted: (holding b62)
   added: (clear b62) (arm-empty) (on-table b62)
   goals met: 5 of 8
29. (unstack b40 b3)
   deleted: (on b40 b3) (clear b40) (arm-empty)
   added: (holding b40) (clear b3)
   goals met: 5 of 8
30. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 5 of 8
31. (unstack b3 b58)
   deleted: (on b3 b58) (clear b3) (arm-empty)
   added: (holding b3) (clear b58)
   goals met: 5 of 8
32. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 6 of 8
33. (unstack b4 b2)
   deleted: (on b4 b2) (clear b4) (arm-empty)
   added: (holding b4) (clear b2)
   goals met: 4 of 8
34. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 5 of 8
35. (unstack b2 b5)
   deleted: (on b2 b5) (clear b2) (arm-empty)
   added: (holding b2) (clear b5)
   goals met: 6 of 8
36. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 7 of 8
37. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 6 of 8
38. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 8 of 8
